**1. Завантаження та огляд**

In [3]:
import pandas as pd
ds = pd.read_csv(r'C:\Users\Олександра\Downloads\tips.csv')

print('Перші 5 рядків')
display(ds.head())

print(f'Розмір датасету: {ds.shape}\n')

print(f'Назви колонок: {list(ds.columns)}\n')

print('Інформація про тип даних')
display(ds.info())

Перші 5 рядків

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

Розмір датасету: (244, 7)

Назви колонок: ['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size']

Інформація про тип даних
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

None

**2. Базова вибірка даних**

In [4]:
total_bill = ds[['total_bill']]
print(f'Колонка total_bill')
display(total_bill)

coop = ds[['total_bill', 'tip']]
print(f'\n Колонки total_bill та tip разом')
display(coop)

print('\n Перші 10 рядків')
display(ds.head(10))

print('\n Рядок з індексом 5')
display(ds.loc[5])

Колонка total_bill

     total_bill
0         16.99
1         10.34
2         21.01
3         23.68
4         24.59
..          ...
239       29.03
240       27.18
241       22.67
242       17.82
243       18.78

[244 rows x 1 columns]

 Колонки total_bill та tip разом

     total_bill   tip
0         16.99  1.01
1         10.34  1.66
2         21.01  3.50
3         23.68  3.31
4         24.59  3.61
..          ...   ...
239       29.03  5.92
240       27.18  2.00
241       22.67  2.00
242       17.82  1.75
243       18.78  3.00

[244 rows x 2 columns]

 Перші 10 рядків

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

 Рядок з індексом 5

total_bill     25.29
tip             4.71
sex             Male
smoker            No
day              Sun
time          Dinner
size               4
Name: 5, dtype: object

**3. Фільтрація даних**

In [5]:
high_bill = ds[ds['total_bill']>20]
print('Рахунки більше 20 доларів')
print(f'Кількість записів: {high_bill.shape}')
display(high_bill.head())

female = ds[ds['sex']=='Female']
print('\nВідвідувачі - жінки')
print(f'Кількість записів: {female.shape}')
display(female.head())

dinner_bill = ds[ds['time']=='Dinner']
print('\nРахунки за вечерю')
print(f'Кількість записів: {dinner_bill.shape}')
display(dinner_bill.head())

dinner_high_bill = ds[(ds['time']=='Dinner') & (ds['total_bill']>30)]
print('\nРахунки за вечерю дорожче 30 доларів')
print(f'Кількість записів: {dinner_high_bill.shape}')
display(dinner_high_bill.head())

Рахунки більше 20 доларів
Кількість записів: (97, 7)

   total_bill   tip     sex smoker  day    time  size
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
7       26.88  3.12    Male     No  Sun  Dinner     4

Відвідувачі - жінки
Кількість записів: (87, 7)

    total_bill   tip     sex smoker  day    time  size
0        16.99  1.01  Female     No  Sun  Dinner     2
4        24.59  3.61  Female     No  Sun  Dinner     4
11       35.26  5.00  Female     No  Sun  Dinner     4
14       14.83  3.02  Female     No  Sun  Dinner     2
16       10.33  1.67  Female     No  Sun  Dinner     3

Рахунки за вечерю
Кількість записів: (176, 7)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

Рахунки за вечерю дорожче 30 доларів
Кількість записів: (27, 7)

    total_bill   tip     sex smoker  day    time  size
11       35.26  5.00  Female     No  Sun  Dinner     4
23       39.42  7.58    Male     No  Sat  Dinner     4
39       31.27  5.00    Male     No  Sat  Dinner     3
44       30.40  5.60    Male     No  Sun  Dinner     4
47       32.40  6.00    Male     No  Sun  Dinner     4

**4. Описова статистика**

In [8]:
average = ds['total_bill'].mean()
tip_mx = ds['tip'].max()
empty = ds.isnull().sum().sum()
bill_time = ds['time'].value_counts()
print(f'Середній розмір рахунку: {average.round(2)}')
print(f'Максимальні чайові: {tip_mx}')
print(f'Кількість пропущених значень у всіх колонках: {empty}')
print(f'Кількість рахунків за обіди і за вечері:\n{bill_time}')

Середній розмір рахунку: 19.79
Максимальні чайові: 10.0
Кількість пропущених значень у всіх колонках: 0
Кількість рахунків за обіди і за вечері:
time
Dinner    176
Lunch      68
Name: count, dtype: int64

**5. Статистика із групуванням**

In [9]:
avr_sex = ds.groupby('sex')['total_bill'].mean()
avr_tips = ds.groupby('day')['tip'].mean()
number_day = ds.groupby('day')['size'].value_counts()
print(f'Середній рахунок за статтю:{avr_sex.round(2)}')
print(f'\nСередні чайові за днем тижня:{avr_tips.round(2)}')
print('\nКількість відвідувачів у кожен день')
display(number_day)

Середній рахунок за статтю:sex
Female    18.06
Male      20.74
Name: total_bill, dtype: float64

Середні чайові за днем тижня:day
Fri     2.73
Sat     2.99
Sun     3.26
Thur    2.77
Name: tip, dtype: float64

Кількість відвідувачів у кожен день

day   size
Fri   2       16
      1        1
      3        1
      4        1
Sat   2       53
      3       18
      4       13
      1        2
      5        1
Sun   2       39
      4       18
      3       15
      5        3
      6        1
Thur  2       48
      4        5
      3        4
      6        3
      1        1
      5        1
Name: count, dtype: int64

**6. Створення нової колонки**

In [10]:
ds['tip_percentage'] = (ds['tip']/ds['total_bill'])*100
display(ds.head(10))

   total_bill   tip     sex smoker  day    time  size  tip_percentage
0       16.99  1.01  Female     No  Sun  Dinner     2        5.944673
1       10.34  1.66    Male     No  Sun  Dinner     3       16.054159
2       21.01  3.50    Male     No  Sun  Dinner     3       16.658734
3       23.68  3.31    Male     No  Sun  Dinner     2       13.978041
4       24.59  3.61  Female     No  Sun  Dinner     4       14.680765
5       25.29  4.71    Male     No  Sun  Dinner     4       18.623962
6        8.77  2.00    Male     No  Sun  Dinner     2       22.805017
7       26.88  3.12    Male     No  Sun  Dinner     4       11.607143
8       15.04  1.96    Male     No  Sun  Dinner     2       13.031915
9       14.78  3.23    Male     No  Sun  Dinner     2       21.853857

**7. Сортування**

In [11]:
bill_sorted = ds.sort_values('total_bill')
tip_sorted = ds.sort_values('tip', ascending = False)
top_five = ds.nlargest(5,'tip')
print('Сортування за зростанням розміру рахунку')
display(bill_sorted)
print('\nСортування за спаданням розміру чайових')
display(tip_sorted)
print('\nТоп 5 найбільших чайових')
display(top_five)

Сортування за зростанням розміру рахунку

     total_bill    tip     sex smoker   day    time  size  tip_percentage
67         3.07   1.00  Female    Yes   Sat  Dinner     1       32.573290
92         5.75   1.00  Female    Yes   Fri  Dinner     2       17.391304
111        7.25   1.00  Female     No   Sat  Dinner     1       13.793103
172        7.25   5.15    Male    Yes   Sun  Dinner     2       71.034483
149        7.51   2.00    Male     No  Thur   Lunch     2       26.631158
..          ...    ...     ...    ...   ...     ...   ...             ...
182       45.35   3.50    Male    Yes   Sun  Dinner     3        7.717751
156       48.17   5.00    Male     No   Sun  Dinner     6       10.379905
59        48.27   6.73    Male     No   Sat  Dinner     4       13.942407
212       48.33   9.00    Male     No   Sat  Dinner     4       18.621974
170       50.81  10.00    Male    Yes   Sat  Dinner     3       19.681165

[244 rows x 8 columns]

Сортування за спаданням розміру чайових

     total_bill    tip     sex smoker   day    time  size  tip_percentage
170       50.81  10.00    Male    Yes   Sat  Dinner     3       19.681165
212       48.33   9.00    Male     No   Sat  Dinner     4       18.621974
23        39.42   7.58    Male     No   Sat  Dinner     4       19.228818
59        48.27   6.73    Male     No   Sat  Dinner     4       13.942407
141       34.30   6.70    Male     No  Thur   Lunch     6       19.533528
..          ...    ...     ...    ...   ...     ...   ...             ...
0         16.99   1.01  Female     No   Sun  Dinner     2        5.944673
111        7.25   1.00  Female     No   Sat  Dinner     1       13.793103
92         5.75   1.00  Female    Yes   Fri  Dinner     2       17.391304
67         3.07   1.00  Female    Yes   Sat  Dinner     1       32.573290
236       12.60   1.00    Male    Yes   Sat  Dinner     2        7.936508

[244 rows x 8 columns]

Топ 5 найбільших чайових

     total_bill    tip   sex smoker   day    time  size  tip_percentage
170       50.81  10.00  Male    Yes   Sat  Dinner     3       19.681165
212       48.33   9.00  Male     No   Sat  Dinner     4       18.621974
23        39.42   7.58  Male     No   Sat  Dinner     4       19.228818
59        48.27   6.73  Male     No   Sat  Dinner     4       13.942407
141       34.30   6.70  Male     No  Thur   Lunch     6       19.533528